In [2]:
import pandas as pd
import sqlalchemy as sa
!pip install psycopg2-binary

Requirement already satisfied: psycopg2-binary in /Users/ak2024/anaconda3/lib/python3.11/site-packages (2.9.9)

## upload database (for SQL query)

In [3]:
Unicorn = "postgresql://Test:bQNxVzJL4g6u@ep-noisy-flower-846766-pooler.us-east-2.aws.neon.tech/Unicorn"
engine = sa.create_engine(Unicorn)
connection = engine.connect()

## creating DataFrames (for python codes)

In [4]:
query = "SELECT * FROM customers"
df_cust = pd.read_sql_query(query,engine)

query = "SELECT * FROM orders"
df_orders = pd.read_sql_query(query,engine)

query = "SELECT * FROM order_details"
df_order_details = pd.read_sql_query(query,engine)

query = "SELECT * FROM product"
df_product = pd.read_sql_query(query,engine)

## 1. How many customers do we have in the data?

sql:

In [5]:
query = """
SELECT
  COUNT(DISTINCT customer_id) AS total_customers
FROM
  customers;
"""
display(pd.read_sql(sa.text(query),connection))

   total_customers
0              795

python:

In [6]:
count_customer = df_cust["customer_id"].count()
print("Total Customers", count_customer)

Total Customers 795

## 2. What was the city with the most profit for the company in 2015?
## 3. In 2015, what was the most profitable city's profit?

sql:

In [7]:
query = """
SELECT
  ord.shipping_city as city,
  SUM(det.order_profits) AS profit
FROM orders ord
JOIN order_details det ON ord.order_id = det.order_id
WHERE
  EXTRACT(YEAR FROM ord.order_date) = 2015
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;
"""
display(pd.read_sql(sa.text(query),connection))

            city   profit
0  New York City  14753.0

python:

## 4. How many different cities do we have in the data?

In [8]:
query = """
SELECT
  COUNT(DISTINCT shipping_city) AS total_unique_cities
FROM orders;
"""
display(pd.read_sql(sa.text(query),connection))

   total_unique_cities
0                  531

## 5. Show the total spent by customers from low to high.

In [9]:
query = """
SELECT
  ord.customer_id,
  cu.customer_name,
  SUM(det.order_sales) AS total_spent
FROM orders ord
JOIN order_details det ON ord.order_id = det.order_id
JOIN customers cu ON ord.customer_id = cu.customer_id
GROUP BY 1, 2
ORDER BY 3 ASC;
"""
display(pd.read_sql(sa.text(query),connection))

     customer_id    customer_name  total_spent
0            456     Lela Donovan          5.0
1            738    Thais Sissman          5.0
2            546  Mitch Gastineau         16.0
3            124     Carl Jackson         17.0
4            657       Roy Skaria         22.0
..           ...              ...          ...
788          758     Tom Ashbrook      14596.0
789          623     Raymond Buch      15117.0
790          388         John Lee      16744.0
791          731     Tamara Chand      19050.0
792          687      Sean Miller      25042.0

[793 rows x 3 columns]

## 6. What is the most profitable city in the State of Tennessee?

In [10]:
query = """
SELECT
  ord.shipping_city,
  SUM(det.order_profits) AS total_profit_city
FROM orders ord
JOIN order_details det ON ord.order_id = det.order_id
WHERE
  ord.shipping_state = 'Tennessee'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;
"""
display(pd.read_sql(sa.text(query),connection))

  shipping_city  total_profit_city
0       Lebanon               83.0

## 7. What’s the average annual profit for that city across all years?

In [11]:
query = """
WITH temp_tab AS(
  SELECT
    	EXTRACT(YEAR FROM ord.order_date) AS years,
    	AVG(det.order_profits) AS average_profit
    	FROM orders ord
    	JOIN order_details det ON ord.order_id = det.order_id
    	WHERE
    	ord.shipping_city = 'Lebanon'
    	GROUP BY 1
    	ORDER BY 2 DESC)
SELECT AVG(average_profit) AS average_annual_profit
FROM temp_tab;
"""
display(pd.read_sql(sa.text(query),connection))

   average_annual_profit
0              27.666667

## 8. What is the distribution of customer types in the data?

In [12]:
query = """
SELECT DISTINCT customer_segment AS customer_types,
   	 COUNT(customer_segment) AS cnt
FROM customers
GROUP BY 1;
"""
display(pd.read_sql(sa.text(query),connection))

  customer_types  cnt
0       Consumer  410
1      Corporate  237
2    Home Office  148

## 9. What’s the most profitable product category on average in Iowa across all years?

In [13]:
query = """
SELECT
  pr.product_category,
  AVG(det.order_profits) AS average_profit
FROM product pr
JOIN order_details det ON pr.product_id = det.product_id
JOIN orders ord ON ord.order_id = det.order_id
WHERE ord.shipping_state = 'Iowa'
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;
"""
display(pd.read_sql(sa.text(query),connection))

  product_category  average_profit
0        Furniture          130.25

## 10. What is the most popular product in that category across all states in 2016?

In [14]:
query = """
SELECT
  pr.product_id,
  pr.product_name,
  SUM(det.quantity) AS order_qty
FROM product pr
JOIN order_details det ON pr.product_id = det.product_id
JOIN orders ord ON ord.order_id = det.order_id
WHERE product_category = 'Furniture'
  AND EXTRACT(YEAR FROM ord.order_date) = 2016
GROUP BY 1, 2
ORDER BY 3 DESC
LIMIT 1;
"""
display(pd.read_sql(sa.text(query),connection))

   product_id                                product_name  order_qty
0         765  Global Push Button Manager's Chair, Indigo       22.0

## 11. Which customer got the most discount in the data? (in total amount)

In [15]:
query = """
WITH temp_tab AS(
SELECT
  ord.customer_id AS customer_id,
  CASE WHEN det.order_discount != 0 THEN (det.order_sales *
    	    det.order_discount) / (1 - det.order_discount)
	   ELSE order_discount
       END AS total_discount
FROM orders ord
JOIN order_details det ON ord.order_id = det.order_id)
SELECT customer_id,
SUM(total_discount) AS total_discount
FROM temp_tab
GROUP BY 1
ORDER BY 2 DESC
LIMIT 1;
"""
display(pd.read_sql(sa.text(query),connection))

   customer_id  total_discount
0          687    23929.083333

## 12. How widely did monthly profits vary in 2018?

In [16]:
query = """
WITH temp_tab AS(
  SELECT
 	EXTRACT(MONTH FROM ord.order_date) AS order_month,
 	SUM(det.order_profits) AS profit_per_month
  FROM orders ord
  JOIN order_details det ON ord.order_id = det.order_id
  WHERE EXTRACT(YEAR FROM ord.order_date) = 2018
  GROUP BY 1)
SELECT order_month, profit_per_month,
  CASE WHEN
  LAG(profit_per_month, 1, 0) OVER(ORDER BY order_month) = 0 THEN   
  profit_per_month
  ELSE (profit_per_month - LAG(profit_per_month, 1, 0) OVER(ORDER BY
  order_month))
  END AS profit_diff_per
FROM temp_tab;
"""
display(pd.read_sql(sa.text(query),connection))

    order_month  profit_per_month  profit_diff_per
0           1.0            7137.0           7137.0
1           2.0            1612.0          -5525.0
2           3.0           14758.0          13146.0
3           4.0             934.0         -13824.0
4           5.0            6342.0           5408.0
5           6.0            8226.0           1884.0
6           7.0            6951.0          -1275.0
7           8.0            9034.0           2083.0
8           9.0           10987.0           1953.0
9          10.0            9272.0          -1715.0
10         11.0            9217.0            -55.0
11         12.0            8473.0           -744.0

## 13. Which order was the highest in 2015?

In [17]:
query = """
SELECT
  ord.order_id,
  SUBSTRING(ord.order_id, 9, 6) AS order_id_l,
  SUM(det.quantity) AS total_qty,
  SUM(DET.order_sales) AS total_sales
FROM orders ord
JOIN order_details det ON ord.order_id = det.order_id
WHERE EXTRACT(YEAR FROM ord.order_date) = 2015
GROUP BY 1
ORDER BY 4 DESC;
"""
display(pd.read_sql(sa.text(query),connection))

           order_id order_id_l  total_qty  total_sales
0    CA-2015-145317     145317       25.0      23660.0
1    CA-2015-139892     139892       37.0      10540.0
2    CA-2015-116904     116904       17.0       9900.0
3    CA-2015-143917     143917       17.0       8320.0
4    CA-2015-145541     145541        4.0       7000.0
..              ...        ...        ...          ...
968  CA-2015-101147     101147        1.0          2.0
969  CA-2015-101770     101770        1.0          2.0
970  US-2015-152723     152723        1.0          1.0
971  CA-2015-112718     112718        1.0          1.0
972  CA-2015-112403     112403        1.0          1.0

[973 rows x 4 columns]

## 14. What was the rank of each city in the East region in 2015 in quantity?

In [18]:
query = """
WITH
  temp_tab AS (
	SELECT
  	ord.shipping_city,
  	SUM(det.quantity) AS qty
	FROM  orders ord
	JOIN order_details det ON ord.order_id = det.order_id
	WHERE
  	EXTRACT(YEAR FROM ord.order_date) = 2015
  	AND ord.shipping_region = 'East'
	GROUP BY  1)
SELECT
  shipping_city,
  qty,
  RANK() OVER (ORDER BY qty DESC) AS rank_city
FROM temp_tab;
"""
display(pd.read_sql(sa.text(query),connection))

    shipping_city     qty  rank_city
0   New York City  1708.0          1
1    Philadelphia   403.0          2
2        Columbus   167.0          3
3          Newark    64.0          4
4       Fairfield    53.0          5
5      Long Beach    44.0          6
6        Lakewood    38.0          7
7       Lancaster    36.0          8
8        Lawrence    31.0          9
9           Dover    30.0         10
10     Hackensack    28.0         11
11         Bangor    24.0         12
12          Utica    24.0         12
13         Lowell    23.0         14
14        Yonkers    22.0         15
15     Wilmington    21.0         16
16        Clinton    20.0         17
17      Baltimore    20.0         17
18       Cranston    20.0         17
19        Everett    19.0         20
20     Providence    19.0         20
21        Buffalo    19.0         20
22         Medina    16.0         23
23        Meriden    15.0         24
24        Beverly    15.0         24
25   New Rochelle    14.0         26
26        Bristol    14.0         26
27      Hempstead    12.0         28
28      Cleveland    12.0         28
29      Rochester    12.0         28
30         Toledo    12.0         28
31      Watertown    12.0         28
32        Chester    11.0         33
33           Troy    11.0         33
34       Franklin    11.0         33
35          Akron    10.0         36
36        Clifton     9.0         37
37      Jamestown     9.0         37
38        Concord     9.0         37
39       Columbia     8.0         40
40         Lorain     8.0         40
41       Hamilton     8.0         40
42     Cincinnati     8.0         40
43          Mason     7.0         44
44   Mount Vernon     7.0         44
45         Linden     7.0         44
46        Reading     6.0         47
47         Revere     6.0         47
48           Kent     5.0         49
49      Oceanside     5.0         49
50    Springfield     5.0         49
51         Orange     4.0         52
52          Parma     4.0         52
53  Niagara Falls     3.0         54
54     Plainfield     3.0         54
55         Marion     3.0         54
56  Bowling Green     2.0         57
57       Freeport     2.0         57
58     Middletown     2.0         57
59     Woonsocket     2.0         57

## 15. Display customer names for customers who are in the segment ‘Consumer’ or ‘Corporate.’ How many customers are there in total?

In [19]:
query = """
SELECT
  COUNT(DISTINCT customer_name) AS total_customer
FROM customers
WHERE customer_segment IN ('Consumer', 'Corporate');
"""
display(pd.read_sql(sa.text(query),connection))

   total_customer
0             647

## 16. Calculate the difference between the largest and smallest order quantities for product id ‘100.’

In [20]:
query = """
SELECT
  MAX(quantity), MIN(quantity), 
  MAX(quantity) - MIN(quantity) AS difference
FROM order_details
WHERE product_id = '100';
"""
display(pd.read_sql(sa.text(query),connection))

   max  min  difference
0    6    2           4

## 17. Calculate the percent of products that are within the category ‘Furniture.’

In [21]:
query = """
SELECT
(COUNT(CASE WHEN product_category = 'Furniture' THEN 1 END)::numeric / COUNT(*)) * 100 AS percent_furniture
FROM product;
"""
display(pd.read_sql(sa.text(query),connection))

   percent_furniture
0          20.540541

## 18. Display the number of product manufacturers with more than 1 product in the product table.
## Example: A product with an identical product manufacturer can be considered a duplicate.

In [22]:
query = """
SELECT
  product_manufacturer,
  COUNT(*) AS num_of_duplicates
FROM product
GROUP BY 1
HAVING COUNT(*) > 1;
"""
display(pd.read_sql(sa.text(query),connection))

    product_manufacturer  num_of_duplicates
0                 Linden                  2
1                Iceberg                  3
2                SanDisk                  8
3                Memorex                 13
4                Bulldog                  2
..                   ...                ...
164              Brother                  2
165           Strathmore                  3
166              Fiskars                  4
167             OtterBox                  4
168           Pressboard                  4

[169 rows x 2 columns]

## 19. Show the product_subcategory and the total number of products in the subcategory. Show the order from most to least products and then by product_subcategory name ascending.

In [23]:
query = """
SELECT
  product_subcategory,
  COUNT(product_id) AS products
FROM product
GROUP BY 1
ORDER BY 2 DESC, 1 ASC;
"""
display(pd.read_sql(sa.text(query),connection))

   product_subcategory  products
0                Paper       277
1              Binders       211
2               Phones       189
3          Furnishings       186
4                  Art       157
5          Accessories       147
6              Storage       132
7           Appliances        97
8               Chairs        88
9               Labels        70
10            Machines        63
11              Tables        56
12           Bookcases        50
13           Envelopes        44
14            Supplies        36
15           Fasteners        34
16             Copiers        13

## 20. Show the product_id(s), the sum of quantities, where the total sum of its product quantities is greater than or equal to 100.

In [24]:
query = """
SELECT
  product_id,
  SUM(quantity) AS total_qty
FROM order_details
WHERE quantity >= 100
GROUP BY 1
ORDER BY 2 ASC;
"""
display(pd.read_sql(sa.text(query),connection))

   product_id  total_qty
0         920      130.0
1         122      143.0
2        1600      216.0
3        1507      324.0

## **Bonus question:** -- Join all database tables into one dataset that includes all unique columns and download it as a .csv file.

In [26]:
query = """
SELECT *
FROM customers
NATURAL JOIN orders
NATURAL JOIN order_details
NATURAL JOIN product;
"""
display(pd.read_sql(sa.text(query),connection))

,product_id,order_id,customer_id,customer_name,customer_segment,order_date,shipping_city,shipping_state,shipping_region,shipping_country,...,order_details_id,quantity,order_discount,order_profits,order_profit_ratio,order_sales,product_name,product_category,product_subcategory,product_manufacturer
0,122,CA-2015-100004,91,Bill Shonely,Corporate,2015-09-06,New York City,New York,East,United States,...,1,62,0.1,327.0,0.39,837,Alphabetical Labels for Top Tab Filing,Office Supplies,Labels,Other
1,764,CA-2015-100004,91,Bill Shonely,Corporate,2015-09-06,New York City,New York,East,United States,...,2,18,0.2,565.0,0.26,2174,"Global Manager's Adjustable Task Chair, Storm",Furniture,Chairs,Global
2,161,CA-2015-100006,224,Dennis Kane,Consumer,2015-09-07,New York City,New York,East,United States,...,3,3,0.0,110.0,0.29,378,AT&T EL51110 DECT,Technology,Phones,AT&T
3,122,CA-2015-100032,62,Arthur Wiediger,Home Office,2015-09-07,New York City,New York,East,United States,...,4,53,0.1,272.0,0.38,715,Alphabetical Labels for Top Tab Filing,Office Supplies,Labels,Other
4,1342,CA-2015-100032,62,Arthur Wiediger,Home Office,2015-09-07,New York City,New York,East,United States,...,5,23,0.1,96.0,0.31,311,Recycled Premium Regency Composition Covers,Office Supplies,Binders,Other
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9992,1820,US-2018-169551,640,Rob Lucas,Consumer,2018-07-07,Philadelphia,Pennsylvania,East,United States,...,10001,3,0.2,5.0,0.35,16,Xerox 216,Office Supplies,Paper,Xerox
9993,125,US-2018-169551,640,Rob Lucas,Consumer,2018-07-07,Philadelphia,Pennsylvania,East,United States,...,10002,3,0.2,5.0,0.29,17,AmazonBasics 3-Button USB Wired Mouse,Technology,Accessories,Other
9994,1190,US-2018-169551,640,Rob Lucas,Consumer,2018-07-07,Philadelphia,Pennsylvania,East,United States,...,10003,3,0.5,-45.0,-0.52,87,O'Sullivan 3-Shelf Heavy-Duty Bookcases,Furniture,Bookcases,O'Sullivan
9995,1278,US-2018-169551,640,Rob Lucas,Consumer,2018-07-07,Philadelphia,Pennsylvania,East,United States,...,10004,2,0.2,86.0,0.16,528,Plantronics CS510 - Over-the-Head monaural Wir...,Technology,Accessories,Plantronics
9996,146,US-2018-169551,640,Rob Lucas,Consumer,2018-07-07,Philadelphia,Pennsylvania,East,United States,...,10005,2,0.4,-114.0,-0.17,684,Apple iPhone 5S,Technology,Phones,Apple